In [1]:
import pandas as pd

In [3]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
#Display 3 top rows of this DataFrame
df1.head(3) #by default it shows 5 rows

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [5]:
#check last 3 rows of this DataFrame
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
#Find shape of dataset (No of rows and columns)
df1.shape

(7, 3)

In [7]:
print('No of rows:', df1.shape[0])
print('No os columns:', df1.shape[1])

No of rows: 7
No os columns: 3

In [8]:
#information about our dataset
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [9]:
#check the null values in Dataset
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [10]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [11]:
 df1.isnull().sum(axis=1) #row wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [12]:
#overall statistics of the data set
df1.describe() #show the statistics for the columns having numeric values

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [13]:
df1.describe(include='all') #now it shows the statistics for all the columns

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [14]:
#uniques values from the gender column
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [15]:
#No of unique values 
df1['Gender'].nunique()

2

In [16]:
#count of unique values in Gender columns
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [20]:
#Find total number of students having marks btw 90 to 100 (inclusive) using Between Method
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [22]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [23]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [24]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [25]:
sum(df1['Marks'].between(90,100))

4

In [27]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [28]:
#find average
df1['Marks'].mean()

92.14285714285714

In [29]:
df1['Marks'].min() #shows minimum

83

In [30]:
df1['Marks'].max()

99

In [36]:
#Apply method
def marks(x):
    return x//2

In [37]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [38]:
df1['half_marks']= df1['Marks'].apply(marks) #creates another column and assign the marks to it after applying function

In [39]:
df1

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [40]:
df1['Marks'].apply(lambda x:x/2) #lambda function

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [41]:
df1['Name'].apply(len) #length of strings available in Name column

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [42]:
#Map Function
df1

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [53]:
df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})

In [55]:
df1.drop(['New'], axis=1)

      Name  Marks  Gender  half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [58]:
df1.drop(['Male_Female', 'New'], axis=1, inplace=True)

In [59]:
df1

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [60]:
#print name of the columns
df1.columns

Index(['Name', 'Marks', 'Gender', 'half_marks'], dtype='object')

In [61]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [62]:
df1

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [63]:
#sort the columns
df1.sort_values(by='Marks') #ascending

      Name  Marks  Gender  half_marks
5   Mittal     83  Female          41
3   Vedant     87    Male          43
1   Aadhya     89  Female          44
4   Parshv     90    Male          45
0  Priyang     98    Male          49
2   Krisha     99  Female          49
6  Archana     99  Female          49

In [65]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender  half_marks
2   Krisha     99  Female          49
6  Archana     99  Female          49
0  Priyang     98    Male          49
4   Parshv     90    Male          45
1   Aadhya     89  Female          44
3   Vedant     87    Male          43
5   Mittal     83  Female          41

In [66]:
df1

      Name  Marks  Gender  half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [69]:
#Display Names and Marks of the Female students only
df1[df1['Gender']=='Female']

      Name  Marks  Gender  half_marks
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [71]:
df1[df1['Gender']=='Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [72]:
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']] #with pandas isin method

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99